In [5]:
import pandas as pd
import fastparquet

In [8]:
df =  pd.read_parquet("/home/costela/Documentos/Escorpiao-series/Dados_processados/2_df_recodificado.parquet")

# df = pd.read_parquet('/home/usuario/Documentos/Escorpiao_series/Dados_processados/2_df_recodificado.parquet')

In [9]:
df.groupby('DT_SIN_PRI').size().reset_index(name='CASOS')

     DT_SIN_PRI  CASOS
0    1940-12-01      1
1    2012-06-22      1
2    2013-01-15      1
3    2013-01-20      1
4    2013-02-11      1
...         ...    ...
2807 2023-12-08    174
2808 2023-12-09    132
2809 2023-12-10    165
2810 2023-12-11    225
2811 2023-12-12    121

[2812 rows x 2 columns]

In [26]:
df.loc[df['DT_SIN_PRI'] == '1940-12-01', 'DT_SIN_PRI'] = '2020-12-01'

In [36]:
df.describe()

,DT_SIN_PRI,ANT_DT_ACI,DT_OBITO,DT_ENCERRA,DT_DIGITA,IDADE_ANOS,ANO,MES,POPULACAO
count,191830,191917,85,189762,228321,291772.000000,191830.000000,191830.000000,2.917700e+05
mean,2019-02-03 11:00:56.712713984,2019-02-03 06:20:02.807463424,2019-06-20 04:48:00,2019-02-05 02:37:04.858506496,2020-07-02 23:03:07.835547392,39.439227,2018.573091,6.848517,2.969957e+05
min,2012-06-22 00:00:00,2011-07-08 00:00:00,2014-10-18 00:00:00,2014-01-01 00:00:00,2014-01-02 00:00:00,0.000000,1940.000000,1.000000,9.320000e+02
25%,2017-02-21 00:00:00,2017-02-20 00:00:00,2017-09-15 00:00:00,2017-02-23 00:00:00,2017-09-05 00:00:00,23.000000,2017.000000,4.000000,1.973300e+04
50%,2018-12-25 00:00:00,2018-12-24 00:00:00,2019-03-10 00:00:00,2018-12-28 00:00:00,2021-06-22 00:00:00,39.000000,2018.000000,7.000000,6.162500e+04
75%,2021-02-09 00:00:00,2021-02-09 00:00:00,2021-09-01 00:00:00,2021-02-07 00:00:00,2022-11-18 00:00:00,56.000000,2021.000000,10.000000,2.084150e+05
max,2023-12-12 00:00:00,2023-12-12 00:00:00,2023-09-26 00:00:00,2025-05-03 00:00:00,2063-12-03 00:00:00,116.000000,2023.000000,12.000000,1.190496e+07
std,NaN,NaN,NaN,NaN,NaN,20.908029,2.627163,3.569217,1.297901e+06

In [38]:
df.loc[df['ANO']> 2021, ['DT_SIN_PRI','ANO']]

       DT_SIN_PRI     ANO
86588  2022-01-01  2022.0
86589  2022-01-01  2022.0
86590  2022-01-01  2022.0
86591  2022-01-01  2022.0
86592  2022-01-01  2022.0
...           ...     ...
291319 2023-10-11  2023.0
291320 2023-02-12  2023.0
291321 2023-06-11  2023.0
291448 2023-09-12  2023.0
291771 2023-09-08  2023.0

[35896 rows x 2 columns]